espressif/esp-idf/components/soc/esp32h21/register/soc/hp_apm_reg.h
/** HP_APM_REGION15_ADDR_START_REG register
 *  Region address register
 */
#define HP_APM_REGION15_ADDR_START_REG (DR_REG_HP_APM_BASE + 0xb8)
/** HP_APM_REGION15_ADDR_START : R/W; bitpos: [31:0]; default: 0;
 *  Start address of region15
 */
#define HP_APM_REGION15_ADDR_START    0xFFFFFFFFU
#define HP_APM_REGION15_ADDR_START_M  (HP_APM_REGION15_ADDR_START_V << HP_APM_REGION15_ADDR_START_S)
#define HP_APM_REGION15_ADDR_START_V  0xFFFFFFFFU
#define HP_APM_REGION15_ADDR_START_S  0

/** HP_APM_REGION15_ADDR_END_REG register
 *  Region address register
 */
#define HP_APM_REGION15_ADDR_END_REG (DR_REG_HP_APM_BASE + 0xbc)
/** HP_APM_REGION15_ADDR_END : R/W; bitpos: [31:0]; default: 4294967295;
 *  End address of region15
 */
#define HP_APM_REGION15_ADDR_END    0xFFFFFFFFU
#define HP_APM_REGION15_ADDR_END_M  (HP_APM_REGION15_ADDR_END_V << HP_APM_REGION15_ADDR_END_S)
#define HP_APM_REGION15_ADDR_END_V  0xFFFFFFFFU
#define HP_APM_REGION15_ADDR_END_S  0

/** HP_APM_REGION15_PMS_ATTR_REG register
 *  Region access authority attribute register
 */
#define HP_APM_REGION15_PMS_ATTR_REG (DR_REG_HP_APM_BASE + 0xc0)
/** HP_APM_REGION15_R0_PMS_X : R/W; bitpos: [0]; default: 0;
 *  Region execute authority in REE_MODE0
 */
#define HP_APM_REGION15_R0_PMS_X    (BIT(0))
#define HP_APM_REGION15_R0_PMS_X_M  (HP_APM_REGION15_R0_PMS_X_V << HP_APM_REGION15_R0_PMS_X_S)
#define HP_APM_REGION15_R0_PMS_X_V  0x00000001U
#define HP_APM_REGION15_R0_PMS_X_S  0
/** HP_APM_REGION15_R0_PMS_W : R/W; bitpos: [1]; default: 0;
 *  Region write authority in REE_MODE0
 */
#define HP_APM_REGION15_R0_PMS_W    (BIT(1))
#define HP_APM_REGION15_R0_PMS_W_M  (HP_APM_REGION15_R0_PMS_W_V << HP_APM_REGION15_R0_PMS_W_S)
#define HP_APM_REGION15_R0_PMS_W_V  0x00000001U
#define HP_APM_REGION15_R0_PMS_W_S  1
/** HP_APM_REGION15_R0_PMS_R : R/W; bitpos: [2]; default: 0;
 *  Region read authority in REE_MODE0
 */
#define HP_APM_REGION15_R0_PMS_R    (BIT(2))
#define HP_APM_REGION15_R0_PMS_R_M  (HP_APM_REGION15_R0_PMS_R_V << HP_APM_REGION15_R0_PMS_R_S)
#define HP_APM_REGION15_R0_PMS_R_V  0x00000001U
#define HP_APM_REGION15_R0_PMS_R_S  2
/** HP_APM_REGION15_R1_PMS_X : R/W; bitpos: [4]; default: 0;
 *  Region execute authority in REE_MODE1
 */
#define HP_APM_REGION15_R1_PMS_X    (BIT(4))
#define HP_APM_REGION15_R1_PMS_X_M  (HP_APM_REGION15_R1_PMS_X_V << HP_APM_REGION15_R1_PMS_X_S)
#define HP_APM_REGION15_R1_PMS_X_V  0x00000001U
#define HP_APM_REGION15_R1_PMS_X_S  4
/** HP_APM_REGION15_R1_PMS_W : R/W; bitpos: [5]; default: 0;
 *  Region write authority in REE_MODE1
 */
#define HP_APM_REGION15_R1_PMS_W    (BIT(5))
#define HP_APM_REGION15_R1_PMS_W_M  (HP_APM_REGION15_R1_PMS_W_V << HP_APM_REGION15_R1_PMS_W_S)
#define HP_APM_REGION15_R1_PMS_W_V  0x00000001U
#define HP_APM_REGION15_R1_PMS_W_S  5
/** HP_APM_REGION15_R1_PMS_R : R/W; bitpos: [6]; default: 0;
 *  Region read authority in REE_MODE1
 */
#define HP_APM_REGION15_R1_PMS_R    (BIT(6))
#define HP_APM_REGION15_R1_PMS_R_M  (HP_APM_REGION15_R1_PMS_R_V << HP_APM_REGION15_R1_PMS_R_S)
#define HP_APM_REGION15_R1_PMS_R_V  0x00000001U
#define HP_APM_REGION15_R1_PMS_R_S  6
/** HP_APM_REGION15_R2_PMS_X : R/W; bitpos: [8]; default: 0;
 *  Region execute authority in REE_MODE2
 */
#define HP_APM_REGION15_R2_PMS_X    (BIT(8))
#define HP_APM_REGION15_R2_PMS_X_M  (HP_APM_REGION15_R2_PMS_X_V << HP_APM_REGION15_R2_PMS_X_S)
#define HP_APM_REGION15_R2_PMS_X_V  0x00000001U
#define HP_APM_REGION15_R2_PMS_X_S  8
/** HP_APM_REGION15_R2_PMS_W : R/W; bitpos: [9]; default: 0;
 *  Region write authority in REE_MODE2
 */
#define HP_APM_REGION15_R2_PMS_W    (BIT(9))
#define HP_APM_REGION15_R2_PMS_W_M  (HP_APM_REGION15_R2_PMS_W_V << HP_APM_REGION15_R2_PMS_W_S)
#define HP_APM_REGION15_R2_PMS_W_V  0x00000001U
#define HP_APM_REGION15_R2_PMS_W_S  9
/** HP_APM_REGION15_R2_PMS_R : R/W; bitpos: [10]; default: 0;
 *  Region read authority in REE_MODE2
 */
#define HP_APM_REGION15_R2_PMS_R    (BIT(10))
#define HP_APM_REGION15_R2_PMS_R_M  (HP_APM_REGION15_R2_PMS_R_V << HP_APM_REGION15_R2_PMS_R_S)
#define HP_APM_REGION15_R2_PMS_R_V  0x00000001U
#define HP_APM_REGION15_R2_PMS_R_S  10

/** HP_APM_FUNC_CTRL_REG register
 *  PMS function control register
 */
#define HP_APM_FUNC_CTRL_REG (DR_REG_HP_APM_BASE + 0xc4)
/** HP_APM_M0_PMS_FUNC_EN : R/W; bitpos: [0]; default: 1;
 *  PMS M0 function enable
 */
#define HP_APM_M0_PMS_FUNC_EN    (BIT(0))
#define HP_APM_M0_PMS_FUNC_EN_M  (HP_APM_M0_PMS_FUNC_EN_V << HP_APM_M0_PMS_FUNC_EN_S)
#define HP_APM_M0_PMS_FUNC_EN_V  0x00000001U
#define HP_APM_M0_PMS_FUNC_EN_S  0
/** HP_APM_M1_PMS_FUNC_EN : R/W; bitpos: [1]; default: 1;
 *  PMS M1 function enable
 */
#define HP_APM_M1_PMS_FUNC_EN    (BIT(1))
#define HP_APM_M1_PMS_FUNC_EN_M  (HP_APM_M1_PMS_FUNC_EN_V << HP_APM_M1_PMS_FUNC_EN_S)
#define HP_APM_M1_PMS_FUNC_EN_V  0x00000001U
#define HP_APM_M1_PMS_FUNC_EN_S  1
/** HP_APM_M2_PMS_FUNC_EN : R/W; bitpos: [2]; default: 1;
 *  PMS M2 function enable
 */
#define HP_APM_M2_PMS_FUNC_EN    (BIT(2))
#define HP_APM_M2_PMS_FUNC_EN_M  (HP_APM_M2_PMS_FUNC_EN_V << HP_APM_M2_PMS_FUNC_EN_S)
#define HP_APM_M2_PMS_FUNC_EN_V  0x00000001U
#define HP_APM_M2_PMS_FUNC_EN_S  2
/** HP_APM_M3_PMS_FUNC_EN : R/W; bitpos: [3]; default: 1;
 *  PMS M3 function enable
 */
#define HP_APM_M3_PMS_FUNC_EN    (BIT(3))
#define HP_APM_M3_PMS_FUNC_EN_M  (HP_APM_M3_PMS_FUNC_EN_V << HP_APM_M3_PMS_FUNC_EN_S)
#define HP_APM_M3_PMS_FUNC_EN_V  0x00000001U
#define HP_APM_M3_PMS_FUNC_EN_S  3

/** HP_APM_M0_STATUS_REG register
 *  M0 status register
 */
#define HP_APM_M0_STATUS_REG (DR_REG_HP_APM_BASE + 0xc8)
/** HP_APM_M0_EXCEPTION_STATUS : RO; bitpos: [1:0]; default: 0;
 *  Exception status
 */
#define HP_APM_M0_EXCEPTION_STATUS    0x00000003U
#define HP_APM_M0_EXCEPTION_STATUS_M  (HP_APM_M0_EXCEPTION_STATUS_V << HP_APM_M0_EXCEPTION_STATUS_S)
#define HP_APM_M0_EXCEPTION_STATUS_V  0x00000003U
#define HP_APM_M0_EXCEPTION_STATUS_S  0

/** HP_APM_M0_STATUS_CLR_REG register
 *  M0 status clear register
 */
#define HP_APM_M0_STATUS_CLR_REG (DR_REG_HP_APM_BASE + 0xcc)
/** HP_APM_M0_REGION_STATUS_CLR : WT; bitpos: [0]; default: 0;
 *  Clear exception status
 */
#define HP_APM_M0_REGION_STATUS_CLR    (BIT(0))
#define HP_APM_M0_REGION_STATUS_CLR_M  (HP_APM_M0_REGION_STATUS_CLR_V << HP_APM_M0_REGION_STATUS_CLR_S)
#define HP_APM_M0_REGION_STATUS_CLR_V  0x00000001U
#define HP_APM_M0_REGION_STATUS_CLR_S  0

/** HP_APM_M0_EXCEPTION_INFO0_REG register
 *  M0 exception_info0 register
 */
#define HP_APM_M0_EXCEPTION_INFO0_REG (DR_REG_HP_APM_BASE + 0xd0)
/** HP_APM_M0_EXCEPTION_REGION : RO; bitpos: [15:0]; default: 0;
 *  Exception region
 */
#define HP_APM_M0_EXCEPTION_REGION    0x0000FFFFU
#define HP_APM_M0_EXCEPTION_REGION_M  (HP_APM_M0_EXCEPTION_REGION_V << HP_APM_M0_EXCEPTION_REGION_S)
#define HP_APM_M0_EXCEPTION_REGION_V  0x0000FFFFU
#define HP_APM_M0_EXCEPTION_REGION_S  0
/** HP_APM_M0_EXCEPTION_MODE : RO; bitpos: [17:16]; default: 0;
 *  Exception mode
 */
#define HP_APM_M0_EXCEPTION_MODE    0x00000003U
#define HP_APM_M0_EXCEPTION_MODE_M  (HP_APM_M0_EXCEPTION_MODE_V << HP_APM_M0_EXCEPTION_MODE_S)
#define HP_APM_M0_EXCEPTION_MODE_V  0x00000003U
#define HP_APM_M0_EXCEPTION_MODE_S  16
/** HP_APM_M0_EXCEPTION_ID : RO; bitpos: [22:18]; default: 0;
 *  Exception id information
 */
#define HP_APM_M0_EXCEPTION_ID    0x0000001FU
#define HP_APM_M0_EXCEPTION_ID_M  (HP_APM_M0_EXCEPTION_ID_V << HP_APM_M0_EXCEPTION_ID_S)
#define HP_APM_M0_EXCEPTION_ID_V  0x0000001FU
#define HP_APM_M0_EXCEPTION_ID_S  18

